tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
brew "openssl@3"
brew "arping"
brew "awscli"
brew "bash-completion"
brew "chezmoi"
brew "cmctl"
brew "curl"
brew "direnv"
brew "docker-compose"
brew "flake8"
brew "fping"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "graphviz"
brew "helm"
brew "htop"
brew "httpie"
brew "jq"
brew "kube-linter"
brew "kubernetes-cli"
brew "localstack"
brew "macvim"
brew "mas"
brew "mcrypt"
brew "mtr"
brew "neofetch"
brew "neovim"
brew "nmap"
brew "node"
brew "nvm"
brew "openjdk"
brew "packer"
brew "php"
brew "pigz"
brew "pipx"
brew "powerlevel10k"
brew "pyenv"
brew "pyenv-virtualenv"
brew "rename"
brew "ripgrep"
brew "salt-lint"
brew "ssh-copy-id"
brew "terraform", link: false
brew "terraforming"
brew "tfenv"
brew "the_silver_searcher"
brew "tmux"
brew "uv"
brew "vault"
brew "wget"
brew "zsh"
brew "zsh-history-substring-search"
cask "1password", args: { appdir: "/Applications" }
cask "1password-cli"
cask "brave-browser", args: { appdir: "/Applications" }
cask "bruno"
cask "cursor"
cask "dbeaver-community"
cask "devtoys"
cask "discord", args: { appdir: "/Applications" }
cask "docker", args: { appdir: "/Applications" }
cask "dockutil"
cask "firefox", args: { appdir: "/Applications" }
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-comic-shanns-mono-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-envy-code-r-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-intone-mono-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-lekton-nerd-font"
cask "font-liberation-nerd-font"
cask "font-lilex-nerd-font"
cask "font-m+-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monocraft-nerd-font"
cask "font-monofur-nerd-font"
cask "font-monoid-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-noto-nerd-font"
cask "font-open-dyslexic-nerd-font"
cask "font-overpass-nerd-font"
cask "font-profont-nerd-font"
cask "font-proggy-clean-tt-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-shure-tech-mono-nerd-font"
cask "font-space-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "font-terminess-ttf-nerd-font"
cask "font-tinos-nerd-font"
cask "font-ubuntu-mono-nerd-font"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono-nerd-font"
cask "github", args: { appdir: "/Applications" }
cask "google-chrome", args: { appdir: "/Applications" }
cask "iterm2", args: { appdir: "/Applications" }
cask "keymapp", args: { appdir: "/Applications" }
cask "launchcontrol", args: { appdir: "/Applications" }
cask "lens", args: { appdir: "/Applications" }
cask "obsidian", args: { appdir: "/Applications" }
cask "oracle-jdk"
cask "orion", args: { appdir: "/Applications" }
cask "setapp", args: { appdir: "/Applications" }
cask "slack", args: { appdir: "/Applications" }
cask "vagrant", args: { appdir: "/Applications" }
cask "visual-studio-code", args: { appdir: "/Applications" }
cask "warp"
cask "wave"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Clocks", id: 414554506
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "RegExRX", id: 498370702
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
vscode "1dot75cm.rpmspec"
vscode "1password.op-vscode"
vscode "4ops.packer"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "alefragnani.project-manager"
vscode "almenon.arepl"
vscode "alphabotsec.vscode-eclipse-keybindings"
vscode "apility.beautify-blade"
vscode "balazs4.gitlab-pipeline-monitor"
vscode "batisteo.vscode-django"
vscode "bbenoist.vagrant"
vscode "betajob.modulestf"
vscode "bibhasdn.django-html"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "bracketpaircolordlw.bracket-pair-color-dlw"
vscode "burkeholland.simple-react-snippets"
vscode "castello-dev.bash-snippets"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "ckolkman.vscode-postgres"
vscode "clinyong.vscode-css-modules"
vscode "codeium.codeium"
vscode "cstrap.flask-snippets"
vscode "cstuder.gitlab-ci-validator"
vscode "dancermak.salt-lsp"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "donjayamanne.githistory"
vscode "donjayamanne.jupyter"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dotjoshjohnson.xml"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "eg2.vscode-npm-script"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "esphome.esphome-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.heygithub"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "hookyqr.beautify"
vscode "idleberg.icon-fonts"
vscode "inaki.vscode-daily-notes"
vscode "includable.file-duplicate"
vscode "ipedrazas.kubernetes-snippets"
vscode "jameswain.gitlab-pipelines"
vscode "janisdd.vscode-edit-csv"
vscode "jasonn-porch.gitlab-mr"
vscode "jasonnutter.search-node-modules"
vscode "jgsqware.gitlab-ci-templates"
vscode "joedevivo.vscode-circuitpython"
vscode "jyee721.gitlab-snippets"
vscode "kamikillerto.vscode-colorize"
vscode "kevinrose.vsc-python-indent"
vscode "korekontrol.saltstack"
vscode "kumar-harsh.graphql-for-vscode"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "localstack.localstack"
vscode "logerfo.gitlab-notifications"
vscode "mads-hartmann.bash-ide-vscode"
vscode "marcostazi.vs-code-vagrantfile"
vscode "mblode.pretty-formatter"
vscode "mechatroner.rainbow-csv"
vscode "mengsicode.vscode-django-boilerplate"
vscode "mgmcdermott.vscode-language-babel"
vscode "mhutchie.git-graph"
vscode "mihaiconstantin.bujo"
vscode "mikemcbride.electron-highlighter"
vscode "mikestead.dotenv"
vscode "mindginative.terraform-snippets"
vscode "mohsen1.prettify-json"
vscode "moshfeu.compare-folders"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azureterraform"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "msjsdiag.debugger-for-chrome"
vscode "neilbarkhina.gitdownloadazurerepos"
vscode "nickdemayo.vscode-json-editor"
vscode "njpwerner.autodocstring"
vscode "okteto.remote-kubernetes"
vscode "oliversturm.fix-json"
vscode "petli-full.json-to-yaml-and-more"
vscode "pflannery.vscode-versionlens"
vscode "pkief.material-icon-theme"
vscode "planbcoding.vscode-react-refactor"
vscode "pomdtr.excalidraw-editor"
vscode "pranaygp.vscode-css-peek"
vscode "randomfractalsinc.vscode-data-preview"
vscode "randrade23.beautify-json"
vscode "rangav.vscode-thunder-client"
vscode "redhat.ansible"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rogalmic.bash-debug"
vscode "rohinivsenthil.terrastate"
vscode "shakram02.bash-beautify"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "stylelint.vscode-stylelint"
vscode "swellaby.node-pack"
vscode "sztheory.vscode-packer-powertools"
vscode "tamasfe.even-better-toml"
vscode "thebarkman.vscode-djaneiro"
vscode "thekalinga.bootstrap4-vscode"
vscode "thibmaek.vsc-esphome-snippets"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscode-icons-team.vscode-icons"
vscode "vsls-contrib.gistfs"
vscode "warpnet.salt-lint"
vscode "warpnet.saltstack-extension-pack"
vscode "wesbos.theme-cobalt2"
vscode "wholroyd.jinja"
vscode "xabikos.javascriptsnippets"
vscode "xabikos.reactsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "yy0931.save-as-root"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
